package domain

const (
	WelcomeMsg = `👋 Добро пожаловать в систему управления отелем!
🆘 Если тебе необходима помощь, воспользуйся кнопкой меню.`

	HelpMsg = `Доступные команды:
📂 Управление сотрудниками:
- /add_employee [TG-логин] [Позиция] [Имя] — добавить работника
- /remove_employee [TG-логин] — удалить работника
- /employees — вывести всех работников
- /send_all_message [Сообщение] - отправить всем работникам сообщение

🛏 Управление клиентами:
- /add_client [Имя] [Фамилия] [Номер паспорта] — добавить клиента

🏨 Управление номерами:
- /add_room [Номер] [Категория] [Цена] — добавить комнату
- /rooms — вывести все комнаты
- /change_room_price [Номер] [Новая цена за сутки] — изменить цену за сутки
- /clean_room [Номер] — выставить уборку в комнату
- /room_cleaned [Номер] — уборка в комнате выполнена
- /add_room [Номер] [Категория] [Цена] — добавить комнату
- /comment_room [Комментарий] - добавить комментарий к комнате

📊 Управление заселением:
- /add_occupancy [Номер] [Паспорт клиента] [Конец занятости (DD-MM-YYYY)] [Опционально: описание] — добавить заселение
- /end_occupancy [ID занятости] — завершить заселение
- /occupancies — вывести все заселения

📈 Дополнительные команды:
- /stats — статистика по занятости номеров
- /help - справка по командам`

	UnknownUserMsg = `✋ К сожалению, вы не зарегистрированы в системе. Попросите владельца добавить вас`

	UnknownMessage = `🚀 Сообщение получено, но не распознано`

	AboutMsg = `💻 Сервис управлением и контролем отеля.

🛠️ Написан на языке Golang с использованием Telegram API. В качестве базы данных используется PostgreSQL.
`
	AboutLink = `https://github.com/i1dus/hotel-manager`
)
